## Context

Starting in 2008, every year Forbes Magazine publishes a list of America's best colleges. When it comes to the question everyone seems to be asking, “Is college worth it? this published list of colleges comes handy to take a decision based on student's requirement or desire.

The mission of the college ranking by Forbes Magazine is to conduct an annual review of the undergraduate institutions that deliver the top academics, best experiences, career success and lowest debt. Whether a school is in the Top 10 or near the bottom of the list, the 650 colleges are the best in the country.

For most families, choosing a four-year college is one of the biggest and most expensive decisions they can make. For students, this time of their life may layout their future plans. So choose carefully.

## About Data

The data set contains the rankings of 650 Unites States colleges along with various other statistics pertaining to each school.

<img src ="https://i.ibb.co/sKwQjfw/Stanford.jpg" width=80% height =40%></img>

### Load required packages

In [1]:
import numpy as np
import pandas as pd
df1=pd.read_csv('ForbesAmericasTopColleges2019.csv')

### Load the data into pandas dataframe and view the details

In [2]:
df1

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,SAT Lower,SAT Upper,ACT Lower,ACT Upper,Website
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0,1460.0,1590.0,32.0,35.0,www.harvard.edu
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0,1390.0,1540.0,32.0,35.0,www.stanford.edu
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0,1460.0,1580.0,32.0,35.0,www.yale.edu
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0,1490.0,1570.0,33.0,35.0,web.mit.edu
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0,1430.0,1570.0,31.0,35.0,www.princeton.edu
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
645,646,New Mexico State University,Las Cruces,NM,Public,13379,14432,8625.0,9582.0,34720,96700.0,64.0,910.0,1160.0,18.0,23.0,www.nmsu.edu
646,647,Indiana State University,Terre Haute,IN,Public,13626,13763,13012.0,9297.0,32938,85600.0,85.0,900.0,1110.0,17.0,23.0,www.indstate.edu
647,648,Emory &amp; Henry College,Emory,VA,Private,1094,1226,19340.0,27155.0,48100,70700.0,72.0,988.0,1170.0,19.0,25.0,www.ehc.edu
648,649,Wells College,Aurora,NY,Private,488,516,22828.0,30207.0,55180,NaN,80.0,NaN,NaN,NaN,NaN,www.wells.edu
649,650,Catawba College,Salisbury,NC,Private,1336,1463,19807.0,23662.0,44921,78100.0,42.0,930.0,1100.0,18.0,23.0,www.catawba.edu

### Dimension of the data

*'shape'* is a property associated with DataFrame. It returns a tuple representing the dimensionality of the DataFrame. First value is giving number of rows and second value is giving number of columns.

In [3]:
df1.ndim

2

In [4]:
df1.shape

(650, 17)

### Datatype of the fields in the data

'info()' method prints information about a DataFrame including the index dtype and column dtypes, non-null values and memory usage

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 650 entries, 0 to 649
Data columns (total 17 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Rank                      650 non-null    int64
 1   Name                      650 non-null    object
 2   City                      650 non-null    object
 3   State                     650 non-null    object
 4   Public/Private            650 non-null    object
 5   Undergraduate Population  650 non-null    int64
 6   Student Population        650 non-null    int64
 7   Net Price                 648 non-null    float64
 8   Average Grant Aid         646 non-null    float64
 9   Total Annual Cost         650 non-null    int64
 10  Alumni Salary             635 non-null    float64
 11  Acceptance Rate           648 non-null    float64
 12  SAT Lower                 551 non-null    float64
 13  SAT Upper                 551 non-null    float64
 14  ACT Lower                 553 non-null    float64
 15  ACT Upper                 553 non-null    float64
 16  Website                   645 non-null    object
dtypes: float64(8), int64(4), object(5)
memory usage: 86.5+ KB

In [6]:
df1.dtypes

Rank                          int64
Name                         object
City                         object
State                        object
Public/Private               object
Undergraduate Population      int64
Student Population            int64
Net Price                   float64
Average Grant Aid           float64
Total Annual Cost             int64
Alumni Salary               float64
Acceptance Rate             float64
SAT Lower                   float64
SAT Upper                   float64
ACT Lower                   float64
ACT Upper                   float64
Website                      object
dtype: object

### Check the missing values in the data
'isnull()' method detects missing values. It returns a boolean same-sized object indicating if the values are NA. NA values, gets mapped to True values.Everything else gets mapped to False values.

'sum()' method followed by 'isnull()' adds up all the True instances per column to give a summary of missing values per column

In [7]:
df1.isnull()

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,SAT Lower,SAT Upper,ACT Lower,ACT Upper,Website
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
645,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
646,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
647,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
648,False,False,False,False,False,False,False,False,False,False,True,False,True,True,True,True,False
649,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [8]:
df1.isnull().sum()

Rank                         0
Name                         0
City                         0
State                        0
Public/Private               0
Undergraduate Population     0
Student Population           0
Net Price                    2
Average Grant Aid            4
Total Annual Cost            0
Alumni Salary               15
Acceptance Rate              2
SAT Lower                   99
SAT Upper                   99
ACT Lower                   97
ACT Upper                   97
Website                      5
dtype: int64

In [9]:
df1.isnull().sum().sum()

420

In [27]:
df1.dropna().shape

(628, 12)

### Data Cleanup

Let's first drop all columns that are not need. 

'drop()' method with 'axis=1' indicates that columns have to be dropped. List of column names to be dropped is passed to the method. 'inplace = True' ensures that the columns are dropped from the DataFrame permanently

In [14]:
df1.drop(['SAT Lower', 'SAT Upper', 'ACT Lower','ACT Upper','Website'],axis=1,inplace=True)

'dropna()' method drops all rows with NA values (by default axis = 0)

In [15]:
df1.head()

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0

In [16]:
df1.dropna(inplace=True)

In [17]:
df1.shape

(628, 12)

### Reset the index of the dataframe

'reset_index()' resets the index of the DataFrame

'drop' as True, will not try to insert index into DataFrame columns

'inplace' as True resets the index permanently

In [18]:
df1.tail(10)

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate
639,640,University of Memphis,Memphis,TN,Public,19875,21521,13921.0,8960.0,36372,85800.0,85.0
640,641,Eastern Kentucky University,Richmond,KY,Public,16155,16612,11892.0,8234.0,31978,80700.0,87.0
641,642,Fisk University,Nashville,TN,Private,701,738,28362.0,9396.0,37070,83600.0,45.0
642,643,Guilford College,Greensboro,NC,Private,1680,2050,23560.0,22964.0,50813,75600.0,91.0
643,644,Carson-Newman University,Jefferson City,TN,Private,1934,2514,18003.0,20126.0,40640,76500.0,67.0
644,645,Morehouse College,Atlanta,GA,Private,2202,2219,34928.0,17318.0,48723,98700.0,74.0
645,646,New Mexico State University,Las Cruces,NM,Public,13379,14432,8625.0,9582.0,34720,96700.0,64.0
646,647,Indiana State University,Terre Haute,IN,Public,13626,13763,13012.0,9297.0,32938,85600.0,85.0
647,648,Emory &amp; Henry College,Emory,VA,Private,1094,1226,19340.0,27155.0,48100,70700.0,72.0
649,650,Catawba College,Salisbury,NC,Private,1336,1463,19807.0,23662.0,44921,78100.0,42.0

In [19]:
df1.reset_index(drop=True,inplace=True)

In [20]:
df1.tail(10)

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate
618,640,University of Memphis,Memphis,TN,Public,19875,21521,13921.0,8960.0,36372,85800.0,85.0
619,641,Eastern Kentucky University,Richmond,KY,Public,16155,16612,11892.0,8234.0,31978,80700.0,87.0
620,642,Fisk University,Nashville,TN,Private,701,738,28362.0,9396.0,37070,83600.0,45.0
621,643,Guilford College,Greensboro,NC,Private,1680,2050,23560.0,22964.0,50813,75600.0,91.0
622,644,Carson-Newman University,Jefferson City,TN,Private,1934,2514,18003.0,20126.0,40640,76500.0,67.0
623,645,Morehouse College,Atlanta,GA,Private,2202,2219,34928.0,17318.0,48723,98700.0,74.0
624,646,New Mexico State University,Las Cruces,NM,Public,13379,14432,8625.0,9582.0,34720,96700.0,64.0
625,647,Indiana State University,Terre Haute,IN,Public,13626,13763,13012.0,9297.0,32938,85600.0,85.0
626,648,Emory &amp; Henry College,Emory,VA,Private,1094,1226,19340.0,27155.0,48100,70700.0,72.0
627,650,Catawba College,Salisbury,NC,Private,1336,1463,19807.0,23662.0,44921,78100.0,42.0

### Check the first 5 rows of the dataset
'head()' function is used to view the top records. By default it displays 5 rows.

In [21]:
df1.head(5)

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0

### Display the last five rows of the dataset
'tail()' function is used to view the last records. By default it displays 5 rows.

In [22]:
df1.tail(5)

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate
623,645,Morehouse College,Atlanta,GA,Private,2202,2219,34928.0,17318.0,48723,98700.0,74.0
624,646,New Mexico State University,Las Cruces,NM,Public,13379,14432,8625.0,9582.0,34720,96700.0,64.0
625,647,Indiana State University,Terre Haute,IN,Public,13626,13763,13012.0,9297.0,32938,85600.0,85.0
626,648,Emory &amp; Henry College,Emory,VA,Private,1094,1226,19340.0,27155.0,48100,70700.0,72.0
627,650,Catawba College,Salisbury,NC,Private,1336,1463,19807.0,23662.0,44921,78100.0,42.0

### Recheck the dimension and info of the data

In [23]:
df1.shape

(628, 12)

In [25]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 628 entries, 0 to 627
Data columns (total 12 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Rank                      628 non-null    int64
 1   Name                      628 non-null    object
 2   City                      628 non-null    object
 3   State                     628 non-null    object
 4   Public/Private            628 non-null    object
 5   Undergraduate Population  628 non-null    int64
 6   Student Population        628 non-null    int64
 7   Net Price                 628 non-null    float64
 8   Average Grant Aid         628 non-null    float64
 9   Total Annual Cost         628 non-null    int64
 10  Alumni Salary             628 non-null    float64
 11  Acceptance Rate           628 non-null    float64
dtypes: float64(4), int64(4), object(4)
memory usage: 59.0+ KB

# Data Analysis

### Get Summary of Data

'describe()' method generates descriptive statistics. Descriptive statistics include those that summarize the central
tendency, dispersion and shape of a dataset's distribution, excluding 'NaN' values

In [24]:
df1.describe()  #outliers-a column having extreme values(max of undergraduate population)
#std:()

,Rank,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate
count,628.000000,628.000000,628.000000,628.000000,628.000000,628.000000,628.000000,628.000000
mean,322.122611,10235.472930,12312.912420,22481.570064,19971.522293,50722.579618,98616.242038,61.721338
std,185.360460,11228.048723,13246.660229,8099.771637,11214.740998,12670.126944,14026.078146,21.795857
min,1.000000,323.000000,406.000000,1298.000000,2975.000000,8646.000000,70700.000000,5.000000
25%,161.750000,2062.750000,2294.500000,16476.000000,9253.000000,40076.000000,88600.000000,49.000000
50%,321.500000,4825.500000,6538.500000,22065.000000,19605.000000,50478.000000,96300.000000,67.000000
75%,479.250000,15867.000000,18357.250000,27880.750000,27431.000000,60965.000000,105400.000000,78.000000
max,650.000000,65100.000000,75044.000000,47270.000000,50897.000000,75735.000000,158200.000000,100.000000

In [26]:
df1.describe(include='all')

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate
count,628.000000,628,628,628,628,628.000000,628.000000,628.000000,628.000000,628.000000,628.000000,628.000000
unique,NaN,628,457,51,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,Harvard University,New York,NY,Private,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,1,14,64,384,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,322.122611,NaN,NaN,NaN,NaN,10235.472930,12312.912420,22481.570064,19971.522293,50722.579618,98616.242038,61.721338
std,185.360460,NaN,NaN,NaN,NaN,11228.048723,13246.660229,8099.771637,11214.740998,12670.126944,14026.078146,21.795857
min,1.000000,NaN,NaN,NaN,NaN,323.000000,406.000000,1298.000000,2975.000000,8646.000000,70700.000000,5.000000
25%,161.750000,NaN,NaN,NaN,NaN,2062.750000,2294.500000,16476.000000,9253.000000,40076.000000,88600.000000,49.000000
50%,321.500000,NaN,NaN,NaN,NaN,4825.500000,6538.500000,22065.000000,19605.000000,50478.000000,96300.000000,67.000000
75%,479.250000,NaN,NaN,NaN,NaN,15867.000000,18357.250000,27880.750000,27431.000000,60965.000000,105400.000000,78.000000
max,650.000000,NaN,NaN,NaN,NaN,65100.000000,75044.000000,47270.000000,50897.000000,75735.000000,158200.000000,100.000000

### 1) Which are the top 5 colleges listed in the Forbes Magazine 2019?

As we need the 'Name' of the colleges, we first pick the 'Name' column and then display the top 5 rows using head() function

<img src ="https://i.ibb.co/dj0PFhK/Harvard.jpg" width=80% height =40%></img>

In [32]:
df1[['Name','Rank']].head()

                                    Name  Rank
0                     Harvard University     1
1                    Stanford University     2
2                        Yale University     3
3  Massachusetts Institute of Technology     4
4                   Princeton University     5

We can also save the information in an object 'top5' and display it

In [33]:
top5=df1[['Name','Rank']].head()

In [34]:
top5

                                    Name  Rank
0                     Harvard University     1
1                    Stanford University     2
2                        Yale University     3
3  Massachusetts Institute of Technology     4
4                   Princeton University     5

### 2) Which state and city do the top 5 colleges belong to?

As we need the 'Name', 'City' and 'State' of the colleges, we first pick the required columns and then display the top 5 rows using head() function

In [37]:
df1[['Name','Rank','City','State']].head()

                                    Name  Rank       City State
0                     Harvard University     1  Cambridge    MA
1                    Stanford University     2   Stanford    CA
2                        Yale University     3  New Haven    CT
3  Massachusetts Institute of Technology     4  Cambridge    MA
4                   Princeton University     5  Princeton    NJ

Note:

As 'City' and 'State' are immediate columns after 'Name', iloc can also be used to get the results

In [38]:
df1.iloc[0:5,0:4]

   Rank                                   Name       City State
0     1                     Harvard University  Cambridge    MA
1     2                    Stanford University   Stanford    CA
2     3                        Yale University  New Haven    CT
3     4  Massachusetts Institute of Technology  Cambridge    MA
4     5                   Princeton University  Princeton    NJ

In [40]:
df1.iloc[0:5,[0,1,3,5]]

   Rank                                   Name State  Undergraduate Population
0     1                     Harvard University    MA                     13844
1     2                    Stanford University    CA                      8402
2     3                        Yale University    CT                      6483
3     4  Massachusetts Institute of Technology    MA                      4680
4     5                   Princeton University    NJ                      5659

### 3) How many states and which all states have the colleges listed by Forbes?

'nunique()' returns number of unique elements in the object. As we want number of unique states, we first pick up the 'State' column of the DataFrame and then call nunique() function

In [46]:
df1.iloc[:,3].nunique()

51

In [45]:
df1['State'].nunique()

51

'unique()' function returns unique values of Series object. Hence, we first pick up the 'State' column of the DataFrame and then call unique() function to get all all the States

In [47]:
df1.iloc[:,3].unique()

array(['MA', 'CA', 'CT', 'NJ', 'PA', 'RI', 'NC', 'NH', 'NY', 'DC', 'IL',
       'IN', 'MI', 'TX', 'MD', 'ME', 'TN', 'MO', 'VA', 'VT', 'MN', 'GA',
       'WA', 'WI', 'FL', 'OH', 'IA', 'CO', 'UT', 'OR', 'LA', 'SC', 'DE',
       'AL', 'AZ', 'OK', 'NE', 'KY', 'KS', 'AR', 'WY', 'NV', 'MS', 'ND',
       'HI', 'MT', 'SD', 'NM', 'ID', 'WV', 'AK'], dtype=object)

In [52]:
df1['State'].value_counts(normalize=True)*100

NY    10.191083
CA     8.917197
PA     6.210191
MA     4.936306
OH     4.617834
IL     3.980892
TX     3.980892
FL     3.184713
NC     3.025478
MN     2.866242
IN     2.866242
VA     2.866242
MI     2.547771
GA     2.229299
TN     2.229299
NJ     2.070064
IA     2.070064
WI     2.070064
WA     1.910828
KY     1.910828
MO     1.910828
MD     1.910828
OR     1.751592
CO     1.751592
CT     1.433121
LA     1.273885
SC     1.273885
AL     1.114650
RI     1.114650
OK     0.955414
NE     0.955414
DC     0.796178
ME     0.796178
MS     0.796178
AR     0.636943
ID     0.636943
MT     0.636943
SD     0.636943
UT     0.636943
AZ     0.636943
VT     0.636943
KS     0.477707
NM     0.477707
NH     0.477707
NV     0.318471
ND     0.318471
AK     0.318471
WY     0.159236
HI     0.159236
DE     0.159236
WV     0.159236
Name: State, dtype: float64

In [ ]:
#10% of the over all colleges are from NY followed by CA and MA

### 4) In all how many private and public colleges are there in the given list?

'Public/Private' column is of object data type in the DataFrame.

'value_count()' returns a series containing counts of unique values

In [54]:
df1['Public/Private'].value_counts(normalize=True)

Private    0.611465
Public     0.388535
Name: Public/Private, dtype: float64

In [110]:
384/628

0.6114649681528662

In [56]:
df1['Public/Private'].value_counts()

Private    384
Public     244
Name: Public/Private, dtype: int64

### 5) From the list how many colleges are there within each State? Which State has highest number of colleges?

As we have to find number of colleges within each State, we first group (groupby()) the data based on 'State'. For each State we then count the colleges using number of unique values (nunique())  in 'Name' field.

As we want the 'State' with highest number of colleges, we sort the values (sort_values()) in descending order to get the results.

<img src ="https://i.ibb.co/GcnXVC0/New-York.jpg" width=80% height =40%></img>

In [59]:
df1[['Name','State']].groupby(by='State').nunique().sort_values(by='Name',ascending=False)

       Name
State
NY       64
CA       56
PA       39
MA       31
OH       29
TX       25
IL       25
FL       20
NC       19
VA       18
MN       18
IN       18
MI       16
TN       14
GA       14
WI       13
NJ       13
IA       13
MO       12
WA       12
KY       12
MD       12
CO       11
OR       11
CT        9
SC        8
LA        8
AL        7
RI        7
OK        6
NE        6
DC        5
ME        5
MS        5
SD        4
AR        4
ID        4
AZ        4
MT        4
UT        4
VT        4
NM        3
NH        3
KS        3
AK        2
NV        2
ND        2
HI        1
DE        1
WV        1
WY        1

### 6) What is percentage of undergraduates in each college? (Add a new field to calculate)

Divsion of 'Undergraduate Population' by 'Student Population' multiplied by 100 will give percentage of undergraduates.

round() method will round off the derived value to 2 decimal places which is then stored in new field 'Percentage UG'

In [66]:
round(df1['Undergraduate Population']/df1['Student Population']*100,2)

0      44.49
1      47.92
2      49.97
3      40.82
4      68.40
       ...
623    99.23
624    92.70
625    99.00
626    89.23
627    91.32
Length: 628, dtype: float64

In [63]:
df1['Percentage_UG']=round(df1['Undergraduate Population']/df1['Student Population']*100,2)

In [67]:
df1.head()

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,Percentage_UG
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0,44.49
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0,47.92
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0,49.97
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0,40.82
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0,68.40

## 7) Which are the 5 colleges with highest percentage of undergraduates?

Let's just pick up 'Name' and 'Percentage UG' field, sort by 'Percentage UG' in descending order to get the desired ouput

In [69]:
df1[['Name','Percentage_UG']].sort_values(by='Percentage_UG', ascending=False).head()

                                       Name  Percentage_UG
556  University of Texas, Rio Grande Valley          99.99
246            Saint John's University (MN)          99.94
552                      Oakland University          99.94
357                    Salisbury University          99.92
338                     St. Norbert College          99.86

### 8) 5 colleges that receive highest Average Grant Aid?

Sort 'Average Grant Aid' in descending order and pick up the top 5 colleges using 'Name' field

<img src ="https://i.ibb.co/TMtRJ54/Yale.jpg" width=80% height =40%></img>

In [71]:
df1[['Name','Average Grant Aid']].sort_values(by='Average Grant Aid', ascending=False).head()

                   Name  Average Grant Aid
2       Yale University            50897.0
1   Stanford University            50134.0
0    Harvard University            49870.0
26      Amherst College            49467.0
13  Columbia University            49185.0


### 9) What is the average Undergraduate population in State of 'CA'?

First lets filter the DataFrame and get only rows with 'State' as 'CA'

We then pick up the 'Undergraduate Population' for the above subset and calculate its mean

round off the final value to 2 decimal places using the round() function

In [79]:
df1[df1['State']=='CA']

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,Percentage_UG
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0,47.92
7,8,California Institute of Technology,Pasadena,CA,Private,1002,2238,24245.0,41408.0,68901,151600.0,8.0,44.77
11,12,Pomona College,Claremont,CA,Private,1599,1665,15840.0,48930.0,69725,117200.0,8.0,96.04
12,13,"University of California, Berkeley",Berkeley,CA,Public,31133,41891,15859.0,18319.0,65003,131800.0,17.0,74.32
22,23,Harvey Mudd College,Claremont,CA,Private,847,861,34464.0,33782.0,74428,158200.0,15.0,98.37
27,29,Claremont McKenna College,Claremont,CA,Private,1345,1364,26933.0,40673.0,71745,125400.0,10.0,98.61
28,30,University of Southern California,Los Angeles,CA,Private,20582,45687,30232.0,36686.0,72209,120600.0,16.0,45.05
35,38,"University of California, Los Angeles",Los Angeles,CA,Public,33148,44027,14309.0,20011.0,61915,116100.0,16.0,75.29
47,51,Santa Clara University,Santa Clara,CA,Private,5754,8629,33738.0,26671.0,69439,134700.0,54.0,66.68
49,54,Pitzer College,Claremont,CA,Private,1074,1087,28423.0,41257.0,70500,96600.0,16.0,98.80
55,60,Scripps College,Claremont,CA,Private,1083,1092,30974.0,31633.0,71060,98600.0,33.0,99.18
74,79,"University of California, San Diego",San Diego,CA,Public,29613,35772,14630.0,18231.0,60177,123700.0,34.0,82.78
79,84,"University of California, Santa Barbara",Santa Barbara,CA,Public,22910,25057,15764.0,19558.0,64125,116300.0,33.0,91.43
82,87,"University of California, Irvine",Irvine,CA,Public,28947,35242,13376.0,18824.0,61872,116000.0,37.0,82.14
83,88,"University of California, Davis",Davis,CA,Public,31437,37380,15737.0,18690.0,63743,112600.0,43.0,84.10
97,102,Occidental College,Los Angeles,CA,Private,1972,2123,29211.0,35704.0,71756,105700.0,42.0,92.89
110,115,"California Polytechnic State University, San L...",San Luis Obispo,CA,Public,21098,22370,19979.0,5891.0,39033,119500.0,35.0,94.31
119,124,Loyola Marymount University,Los Angeles,CA,Private,6591,9618,40676.0,19787.0,64735,113300.0,52.0,68.53
124,129,Pepperdine University,Malibu,CA,Private,3803,7710,33814.0,31980.0,70862,103900.0,40.0,49.33
137,142,University of San Diego,San Diego,CA,Private,6177,8905,34752.0,24364.0,65426,109400.0,50.0,69.37
172,178,Chapman University,Orange,CA,Private,6756,9392,39228.0,26378.0,69464,99400.0,57.0,71.93
175,181,San Diego State University,San Diego,CA,Public,31609,35158,14030.0,7549.0,40104,102800.0,35.0,89.91
177,183,"University of California, Santa Cruz",Santa Cruz,CA,Public,17925,19457,17877.0,18050.0,64054,104700.0,51.0,92.13
192,199,"University of California, Riverside",Riverside,CA,Public,21017,23279,12344.0,21249.0,62677,106900.0,57.0,90.28
203,210,University of San Francisco,San Francisco,CA,Private,7495,11063,32210.0,27943.0,65980,109900.0,66.0,67.75
228,236,Westmont College,Santa Barbara,CA,Private,1300,1356,31039.0,26711.0,60930,102400.0,85.0,95.87
230,238,University of the Pacific (CA),Stockton,CA,Private,3639,6255,29171.0,26884.0,64796,109300.0,65.0,58.18
247,255,California Lutheran University,Thousand Oaks,CA,Private,3207,4236,25871.0,27282.0,59877,95000.0,73.0,75.71
255,263,Point Loma Nazarene University,San Diego,CA,Private,3313,4417,31452.0,16687.0,49844,90100.0,76.0,75.01
264,272,"California State University, Long Beach",Long Beach,CA,Public,34415,37622,9423.0,8454.0,35946,101700.0,28.0,91.48
265,273,"California State Polytechnic University, Pomona",Pomona,CA,Public,24747,26053,13068.0,7957.0,37937,110800.0,55.0,94.99
267,275,University of Redlands,Redlands,CA,Private,3556,4898,29520.0,30419.0,67024,102400.0,75.0,72.60
285,293,Biola University,La Mirada,CA,Private,4256,6172,31492.0,18028.0,54516,92500.0,72.0,68.96
287,295,San Jose State University,San Jose,CA,Public,27394,35835,14627.0,8545.0,40046,114700.0,67.0,76.44
289,297,Saint Mary's College of California,Moraga,CA,Private,3018,3913,33570.0,29572.0,65524,110800.0,82.0,77.13
292,300,"California State University, Fullerton",Fullerton,CA,Public,38279,40905,8737.0,8436.0,39222,98400.0,46.0,93.58
301,309,California State University Maritime Academy,Vallejo,CA,Public,1090,1181,16416.0,7716.0,39962,129600.0,66.0,92.29
324,332,Master's University,Santa Clarita,CA,Private,1551,1946,26292.0,18498.0,47766,86600.0,66.0,79.70
327,335,"California State University, Chico",Chico,CA,Public,17732,17875,14703.0,8615.0,36300,105100.0,68.0,99.20
335,343,Mills College,Oakland,CA,Private,869,1310,24558.0,35560.0,63767,91200.0,87.0,66.34
393,402,California Institute of the Arts,Santa Clarita,CA,Private,991,1498,46101.0,15401.0,68993,91000.0,24.0,66.15
407,416,Azusa Pacific University,Azusa,CA,Private,6263,9926,27267.0,21186.0,52396,85700.0,60.0,63.10
408,417,"California State University, Fresno",Fresno,CA,Public,23020,25325,5872.0,10267.0,32311,97300.0,59.0,90.90
417,426,San Francisco State University,San Francisco,CA,Public,29485,29758,13787.0,8470.0,38599,99500.0,70.0,99.08
420,429,Whittier College,Whittier,CA,Private,1660,1987,25322.0,28841.0,61409,95600.0,74.0,83.54
425,434,"California State University, Stanislaus",Turlock,CA,Public,9299,10327,6295.0,8875.0,32434,94200.0,77.0,90.05
446,455,University of La Verne,La Verne,CA,Private,6653,8159,25429.0,24969.0,59826,90500.0,48.0,81.54
448,457,Sonoma State University,Rohnert Park,CA,Public,9244,9481,17296.0,7277.0,37914,97100.0,82.0,97.50
460,469,"California State University, Sacramento",Sacramento,CA,Public,30445,31255,9733.0,8984.0,37622,101100.0,68.0,97.41
465,474,"California State University, Northridge",Northridge,CA,Public,37184,41319,5703.0,9782.0,34007,97300.0,58.0,89.99
483,492,"California State University, East Bay",Hayward,CA,Public,14691,16538,11566.0,9402.0,36990,103500.0,74.0,88.83
490,499,"California State University, Los Angeles",Los Angeles,CA,Public,24862,28531,3792.0,9553.0,36726,93800.0,46.0,87.14
491,500,"California State University, San Bernardino",San Bernardino,CA,Public,19244,20692,8519.0,9287.0,36127,87500.0,57.0,93.00
514,524,Mount Saint Mary's University (CA),Los Angeles,CA,Private,3100,3226,28274.0,23270.0,59392,97500.0,81.0,96.09
539,552,Vanguard University,Costa Mesa,CA,Private,2116,2394,21374.0,22396.0,46770,85600.0,47.0,88.39
603,623,Humboldt State University,Arcata,CA,Public,8525,8602,14490.0,9038.0,36601,89000.0,82.0,99.10

In [81]:
round(df1[df1['State']=='CA']['Undergraduate Population'].mean(),2)

13186.91

In [82]:
round(df1[df1['State']=='CA']['Undergraduate Population'].max(),2)

38279

### 10) Which are the colleges where chances of admission is high?

As per the data dictionary 'Acceptance Rate' field provides information on chances of admission. We can sort this column in descending order to get the results

In [85]:
df1[['Name','Acceptance Rate']].sort_values(by='Acceptance Rate',ascending=False).head()

                                   Name  Acceptance Rate
588        University of Texas, El Paso            100.0
607  University of Southern Mississippi             98.0
339               University of Wyoming             97.0
616             Wright State University             97.0
300              University of Kentucky             96.0

### 11) Find if there are any 'Art' colleges in the list

To find a specific string value 'Art' we will use the 'contains()' method. We will pass the string in the paranthesis which needs to be located in the dataframe variable.

In [90]:
df1[df1['Name'].str.contains('Art')]

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,Percentage_UG
295,303,Maryland Institute College of Art,Baltimore,MD,Private,2041,2128,38763.0,18939.0,62850,84500.0,62.0,95.91
393,402,California Institute of the Arts,Santa Clarita,CA,Private,991,1498,46101.0,15401.0,68993,91000.0,24.0,66.15

### 12) Lets divide the Alumni Salary equally into 3 buckets (Low Salary - L; Medium Salary - M; High Salary - H ) and check which colleges falls in 'H' bucket

In [92]:
df1['Alumni Salary'].describe()

count       628.000000
mean      98616.242038
std       14026.078146
min       70700.000000
25%       88600.000000
50%       96300.000000
75%      105400.000000
max      158200.000000
Name: Alumni Salary, dtype: float64

In [93]:
df=df1.copy()3
\4

In [96]:
df.head(1)

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,Percentage_UG
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0,44.49

Take a copy of the original DataFrame to work on

In [97]:
df1['Alumni Salary Level']=pd.cut(df['Alumni Salary'],3,labels=['L','M','H'])

In [98]:
df1

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,Percentage_UG,Alumni Salary Level
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0,44.49,H
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0,47.92,H
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0,49.97,H
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0,40.82,H
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0,68.40,H
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
623,645,Morehouse College,Atlanta,GA,Private,2202,2219,34928.0,17318.0,48723,98700.0,74.0,99.23,L
624,646,New Mexico State University,Las Cruces,NM,Public,13379,14432,8625.0,9582.0,34720,96700.0,64.0,92.70,L
625,647,Indiana State University,Terre Haute,IN,Public,13626,13763,13012.0,9297.0,32938,85600.0,85.0,99.00,L
626,648,Emory &amp; Henry College,Emory,VA,Private,1094,1226,19340.0,27155.0,48100,70700.0,72.0,89.23,L
627,650,Catawba College,Salisbury,NC,Private,1336,1463,19807.0,23662.0,44921,78100.0,42.0,91.32,L

'cut()' function bins values into discrete intervals. 'cut()' function is used when you need to segment and sort data values into bins. This function is also useful for going from a continuous variable to a categorical variable.

In the above code we have created 3 bins using 'Alumni Salary' column. Lowest range of salary is labelled as 'L', middle range is labelled as 'M' and highest range of salary is labelled as 'H'. These labels are saved in a new column 'Alumni Sal Level'.

Note: The entire range of the 'Alumni Salary' has been divided into 3 equal ranges i.e. 3 bins

In [99]:
df1['Alumni Salary Level'].value_counts()

L    383
M    217
H     28
Name: Alumni Salary Level, dtype: int64

### 13) Let's check the mean Alumni Salary at each level

In [100]:
df1[['Alumni Salary Level','Alumni Salary']].groupby(by='Alumni Salary Level').mean()

                     Alumni Salary
Alumni Salary Level
L                     89835.770235
M                    109086.635945
H                    137575.000000

In [101]:
df1[['Alumni Salary Level','Alumni Salary']].groupby(by='Alumni Salary Level').min()

                     Alumni Salary
Alumni Salary Level
L                          70700.0
M                          99900.0
H                         129500.0

In [102]:
df1[['Alumni Salary Level','Alumni Salary']].groupby(by='Alumni Salary Level').max()

                     Alumni Salary
Alumni Salary Level
L                          99700.0
M                         128200.0
H                         158200.0

### 14) Let's create a new dataframe to further analyze the 28 colleges with High Alumni Salary

In [103]:
df_Alumin_High=df[df1['Alumni Salary Level']=='H']

In [104]:
df_Alumin_High

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,Percentage_UG
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0,44.49
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0,47.92
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0,49.97
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0,40.82
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0,68.40
5,6,University of Pennsylvania,Philadelphia,PA,Private,13437,25367,24242.0,44801.0,71715,133900.0,9.0,52.97
7,8,California Institute of Technology,Pasadena,CA,Private,1002,2238,24245.0,41408.0,68901,151600.0,8.0,44.77
8,9,Duke University,Durham,NC,Private,7184,16130,35737.0,47836.0,71764,132100.0,10.0,44.54
9,10,Dartmouth College,Hanover,NH,Private,4693,6509,30421.0,47171.0,71827,130900.0,10.0,72.10
12,13,"University of California, Berkeley",Berkeley,CA,Public,31133,41891,15859.0,18319.0,65003,131800.0,17.0,74.32
17,18,University of Notre Dame,Notre Dame,IN,Private,8664,12467,28768.0,39590.0,69395,130500.0,19.0,69.50
20,21,Rice University,Houston,TX,Private,4036,7022,20237.0,36387.0,63158,129500.0,16.0,57.48
22,23,Harvey Mudd College,Claremont,CA,Private,847,861,34464.0,33782.0,74428,158200.0,15.0,98.37
34,37,Carnegie Mellon University,Pittsburgh,PA,Private,6941,13869,31102.0,38163.0,70094,136100.0,22.0,50.05
42,46,Colgate University,Hamilton,NY,Private,2894,3025,23310.0,45108.0,69860,130600.0,28.0,95.67
47,51,Santa Clara University,Santa Clara,CA,Private,5754,8629,33738.0,26671.0,69439,134700.0,54.0,66.68
57,62,Babson College,Babson Park,MA,Private,2354,3329,35540.0,36717.0,68432,133800.0,24.0,70.71
60,65,Georgia Institute of Technology,Atlanta,GA,Public,17223,29376,13291.0,12779.0,49366,133400.0,23.0,58.63
61,66,United States Merchant Marine Academy,Kings Point,NY,Public,912,975,6758.0,3597.0,8646,140700.0,22.0,93.54
62,67,Lehigh University,Bethlehem,PA,Private,5337,7017,34212.0,36014.0,65925,134100.0,25.0,76.06
88,93,Worcester Polytechnic Institute,Worcester,MA,Private,4654,6642,40376.0,19515.0,65046,135500.0,48.0,70.07
89,94,Colorado School of Mines,Golden,CO,Public,4811,6209,25710.0,10725.0,52698,139600.0,56.0,77.48
105,110,Rose-Hulman Institute of Technology,Terre Haute,IN,Private,2245,2254,36906.0,20967.0,65031,135800.0,61.0,99.60
108,113,Rensselaer Polytechnic Institute,Troy,NY,Private,6371,7592,34839.0,30596.0,70132,134100.0,43.0,83.92
147,152,Stevens Institute of Technology,Hoboken,NJ,Private,3144,6916,36620.0,25762.0,67204,139900.0,44.0,45.46
200,207,Clarkson University,Potsdam,NY,Private,3335,4233,30563.0,32540.0,66106,130100.0,66.0,78.79
301,309,California State University Maritime Academy,Vallejo,CA,Public,1090,1181,16416.0,7716.0,39962,129600.0,66.0,92.29
325,333,SUNY Maritime College,Throggs Neck,NY,Public,1778,1794,18413.0,7134.0,34958,140700.0,69.0,99.11

In [108]:
##Manual Binning
cut_labels=['Low','Medium','High']
Cut_bins=[0,90000,110000,160000]
df['Alumni_Sal_Lev']=pd.cut(df['Alumni Salary'],Cut_bins,labels=cut_labels)

Passing 'include = 'all'' to describe() method provides descriptive summary of all fields in the DataFrame. 'T' property transposes the table which helps in reviewing the statistics per column

In [109]:
df

,Rank,Name,City,State,Public/Private,Undergraduate Population,Student Population,Net Price,Average Grant Aid,Total Annual Cost,Alumni Salary,Acceptance Rate,Percentage_UG,Alumni_Sal_Lev
0,1,Harvard University,Cambridge,MA,Private,13844,31120,14327.0,49870.0,69600,146800.0,5.0,44.49,High
1,2,Stanford University,Stanford,CA,Private,8402,17534,13261.0,50134.0,69109,145200.0,5.0,47.92,High
2,3,Yale University,New Haven,CT,Private,6483,12974,18627.0,50897.0,71290,138300.0,7.0,49.97,High
3,4,Massachusetts Institute of Technology,Cambridge,MA,Private,4680,11466,20771.0,43248.0,67430,155200.0,7.0,40.82,High
4,5,Princeton University,Princeton,NJ,Private,5659,8273,9327.0,48088.0,66150,139400.0,6.0,68.40,High
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
623,645,Morehouse College,Atlanta,GA,Private,2202,2219,34928.0,17318.0,48723,98700.0,74.0,99.23,Medium
624,646,New Mexico State University,Las Cruces,NM,Public,13379,14432,8625.0,9582.0,34720,96700.0,64.0,92.70,Medium
625,647,Indiana State University,Terre Haute,IN,Public,13626,13763,13012.0,9297.0,32938,85600.0,85.0,99.00,Low
626,648,Emory &amp; Henry College,Emory,VA,Private,1094,1226,19340.0,27155.0,48100,70700.0,72.0,89.23,Low
627,650,Catawba College,Salisbury,NC,Private,1336,1463,19807.0,23662.0,44921,78100.0,42.0,91.32,Low

### Happy Learning!!!